{"floating point - How to convert Decimal to Double in C#?": "\nAn explicit cast to double like this isn't necessary:\ndouble trans = (double) trackBar1.Value / 5000.0;\n\nIdentifying the constant as 5000.0 (or as 5000d) is sufficient:\ndouble trans = trackBar1.Value / 5000.0;\ndouble trans = trackBar1.Value / 5000d;\n\n", "html - Why did the width collapse in the percentage width child element in an absolutely positioned parent on Internet Explorer 7?": "\nThe parent div needs to have a defined width, either in pixels or as a percentage. In Internet Explorer 7, the parent div needs a defined width for child percentage divs to work correctly.\n", "c# - How do I calculate someone's age based on a DateTime type birthday?": "\nAn easy to understand and simple solution.\n// Save today's date.\nvar today = DateTime.Today;\n\n// Calculate the age.\nvar age = today.Year - birthdate.Year;\n\n// Go back to the year in which the person was born in case of a leap year\nif (birthdate.Date > today.AddYears(-age)) age--;\n\nHowever, this assumes you are looking for the western idea of the age and not using East Asian reckoning.\n", "datetime - Calculate relative time in C#": "\nJeff, your code is nice but could be clearer with constants (as suggested in Code Complete).\nconst int SECOND = 1;\nconst int MINUTE = 60 * SECOND;\nconst int HOUR = 60 * MINUTE;\nconst int DAY = 24 * HOUR;\nconst int MONTH = 30 * DAY;\n\nvar ts = new TimeSpan(DateTime.UtcNow.Ticks - yourDate.Ticks);\ndouble delta = Math.Abs(ts.TotalSeconds);\n\nif (delta < 1 * MINUTE)\n  return ts.Seconds == 1 ? \"one second ago\" : ts.Seconds + \" seconds ago\";\n\nif (delta < 2 * MINUTE)\n  return \"a minute ago\";\n\nif (delta < 45 * MINUTE)\n  return ts.Minutes + \" minutes ago\";\n\nif (delta < 90 * MINUTE)\n  return \"an hour ago\";\n\nif (delta < 24 * HOUR)\n  return ts.Hours + \" hours ago\";\n\nif (delta < 48 * HOUR)\n  return \"yesterday\";\n\nif (delta < 30 * DAY)\n  return ts.Days + \" days ago\";\n\nif (delta < 12 * MONTH)\n{\n  int months = Convert.ToInt32(Math.Floor((double)ts.Days / 30));\n  return months <= 1 ? \"one month ago\" : months + \" months ago\";\n}\nelse\n{\n  int years = Convert.ToInt32(Math.Floor((double)ts.Days / 365));\n  return years <= 1 ? \"one year ago\" : years + \" years ago\";\n}\n\n", "html - Determine a user's timezone": "\n-new Date().getTimezoneOffset()/60;\n\nThe method getTimezoneOffset() will subtract your time from GMT and return the number of minutes. So if you live in GMT-8, it will return 480.\nTo put this into hours, divide by 60. Also, notice that the sign is the opposite of what you need - it's calculating GMT's offset from your time zone, not your time zone's offset from GMT. To fix this, simply multiply by -1. \nAlso note that w3school says:\n\nThe returned value is not a constant, because of the practice of using\n  Daylight Saving Time.\n\n", "database - Throw an error preventing a table update in a MySQL trigger": "\nAs of MySQL 5.5, you can use the SIGNAL syntax to throw an exception:\nsignal sqlstate '45000' set message_text = 'My Error Message';\n\nState 45000 is a generic state representing \"unhandled user-defined exception\".\n\nHere is a more complete example of the approach:\ndelimiter //\nuse test//\ncreate table trigger_test\n(\n    id int not null\n)//\ndrop trigger if exists trg_trigger_test_ins //\ncreate trigger trg_trigger_test_ins before insert on trigger_test\nfor each row\nbegin\n    declare msg varchar(128);\n    if new.id < 0 then\n        set msg = concat('MyTriggerError: Trying to insert a negative value in trigger_test: ', cast(new.id as char));\n        signal sqlstate '45000' set message_text = msg;\n    end if;\nend\n//\n\ndelimiter ;\n-- run the following as seperate statements:\ninsert into trigger_test values (1), (-1), (2); -- everything fails as one row is bad\nselect * from trigger_test;\ninsert into trigger_test values (1); -- succeeds as expected\ninsert into trigger_test values (-1); -- fails as expected\nselect * from trigger_test;\n\n", "How to use the C socket API in C++ on z/OS": "\nKeep a copy of the IBM manuals handy:\n\n z/OS V1R11.0 XL C/C++ Programming Guide \n z/OS V1R11.0 XL C/C++ Run-Time Library Reference \n\nThe IBM publications are generally very good, but you need to get used to their format, as well as knowing where to look for an answer.  You'll find quite often that a feature that you want to use is guarded by a \"feature test macro\"\nYou should ask your friendly system programmer to install the XL C/C++ Run-Time Library Reference: Man Pages\n on your system.  Then you can do things like \"man connect\" to pull up the man page for the socket connect() API.  When I do that, this is what I see:\nFORMAT\nX/Open\n#define _XOPEN_SOURCE_EXTENDED 1\n#include <sys/socket.h>\n\nint connect(int socket, const struct sockaddr *address, socklen_t address_len);\n\nBerkeley Sockets\n#define _OE_SOCKETS\n#include <sys/types.h>\n#include <sys/socket.h>\n\nint connect(int socket, struct sockaddr *address, int address_len);\n\n", "database - Binary Data in MySQL": "\nThe answer by phpguy is correct but I think there is a lot of confusion in the  additional details there.\nThe basic answer is in a BLOB data type / attribute domain. BLOB is short for Binary Large Object and that column data type is specific for handling binary data.\nSee the relevant manual page for MySQL.\n", ".net - Difference between Math.Floor() and Math.Truncate()": "\nMath.Floor rounds down, Math.Ceiling rounds up, and Math.Truncate rounds towards zero. Thus, Math.Truncate is like Math.Floor for positive numbers, and like Math.Ceiling for negative numbers. Here's the reference.\nFor completeness, Math.Round rounds to the nearest integer. If the number is exactly midway between two integers, then it rounds towards the even one. Reference.\nSee also: Pax Diablo's answer. Highly recommended!\n", "arrays - How to unload a ByteArray using Actionscript 3?": "\nI don't think you have anything to worry about. If System.totalMemory goes down you can relax. It may very well be the OS that doesn't reclaim the newly freed memory (in anticipation of the next time Flash Player will ask for more memory).\nTry doing something else that is very memory intensive and I'm sure that you'll notice that the memory allocated to Flash Player will decrease and be used for the other process instead.\nAs I've understood it, memory management in modern OS's isn't intuitive from the perspective of looking at the amounts allocated to each process, or even the total amount allocated.\nWhen I've used my Mac for 5 minutes 95% of my 3 GB RAM is used, and it will stay that way, it never goes down. That's just the way the OS handles memory.\nAs long as it's not needed elsewhere even processes that have quit still have memory assigned to them (this can make them launch quicker the next time, for example).\n", "Check for changes to an SQL Server table?": "\nTake a look at the CHECKSUM command:\nSELECT CHECKSUM_AGG(BINARY_CHECKSUM(*)) FROM sample_table WITH (NOLOCK);\n\nThat will return the same number each time it's run as long as the table contents haven't changed. See my post on this for more information:\nCHECKSUM\nHere's how I used it to rebuild cache dependencies when tables changed:\nASP.NET 1.1 database cache dependency (without triggers)\n", "c# - Reliable timer in a console application": "\nYou can use something like Console.ReadLine() to block the main thread, so other background threads (like timer threads) will still work. You may also use an AutoResetEvent to block the execution, then (when you need to) you can call Set() method on that AutoResetEvent object to release the main thread. Also ensure that your reference to Timer object doesn't go out of scope and garbage collected.\n", "Best way to allow plugins for a PHP application": "\nYou could use an Observer pattern.  A simple functional way to accomplish this:\n<?php\n\n/** Plugin system **/\n\n$listeners = array();\n\n/* Create an entry point for plugins */\nfunction hook() {\n    global $listeners;\n\n    $num_args = func_num_args();\n    $args = func_get_args();\n\n    if($num_args < 2)\n        trigger_error(\"Insufficient arguments\", E_USER_ERROR);\n\n    // Hook name should always be first argument\n    $hook_name = array_shift($args);\n\n    if(!isset($listeners[$hook_name]))\n        return; // No plugins have registered this hook\n\n    foreach($listeners[$hook_name] as $func) {\n        $args = $func($args); \n    }\n    return $args;\n}\n\n/* Attach a function to a hook */\nfunction add_listener($hook, $function_name) {\n    global $listeners;\n    $listeners[$hook][] = $function_name;\n}\n\n/////////////////////////\n\n/** Sample Plugin **/\nadd_listener('a_b', 'my_plugin_func1');\nadd_listener('str', 'my_plugin_func2');\n\nfunction my_plugin_func1($args) {\n    return array(4, 5);\n}\n\nfunction my_plugin_func2($args) {\n    return str_replace('sample', 'CRAZY', $args[0]);\n}\n\n/////////////////////////\n\n/** Sample Application **/\n\n$a = 1;\n$b = 2;\n\nlist($a, $b) = hook('a_b', $a, $b);\n\n$str  = \"This is my sample application\\n\";\n$str .= \"$a + $b = \".($a+$b).\"\\n\";\n$str .= \"$a * $b = \".($a*$b).\"\\n\";\n\n$str = hook('str', $str);\necho $str;\n?>\n\nOutput:\nThis is my CRAZY application\n4 + 5 = 9\n4 * 5 = 20\n\nNotes:\nFor this example source code, you must declare all your plugins before the actual source code that you want to be extendable.  I've included an example of how to handle single or multiple values being passed to the plugin.  The hardest part of this is writing the actual documentation which lists what arguments get passed to each hook.\nThis is just one method of accomplishing a plugin system in PHP.  There are better alternatives, I suggest you check out the WordPress Documentation for more information.\n", "Multiple submit buttons in an HTML form": "\nI'm just doing the trick of floating the buttons to the right.\nThis way the Prev button is left of the Next button, but the Next comes first in the HTML structure:\n\n\n.f {\n  float: right;\n}\n.clr {\n  clear: both;\n}\n<form action=\"action\" method=\"get\">\n  <input type=\"text\" name=\"abc\">\n  <div id=\"buttons\">\n    <input type=\"submit\" class=\"f\" name=\"next\" value=\"Next\">\n    <input type=\"submit\" class=\"f\" name=\"prev\" value=\"Prev\">\n    <div class=\"clr\"></div><!-- This div prevents later elements from floating with the buttons. Keeps them 'inside' div#buttons -->\n  </div>\n</form>\n\n\n\nBenefits over other suggestions: no JavaScript code, accessible, and both buttons remain type=\"submit\".\n", "c# - Filling a DataSet or a DataTable from a LINQ query result set": "\nAs mentioned in the question, IEnumerable has a CopyToDataTable method:\nIEnumerable<DataRow> query =\n    from order in orders.AsEnumerable()\n    where order.Field<DateTime>(\"OrderDate\") > new DateTime(2001, 8, 1)\n    select order;\n\n// Create a table from the query.\nDataTable boundTable = query.CopyToDataTable<DataRow>();\n\nWhy won't that work for you?\n", "c# - How do I get a distinct, ordered list of names from a DataTable using LINQ?": "\nThe problem is that the Distinct\n operator does not grant that it will\n maintain the original order of\n values.\nSo your query will need to work like this\nvar names = (from DataRow dr in dataTable.Rows\n             select (string)dr[\"Name\"]).Distinct().OrderBy( name => name );\n\n", "Microsoft Office 2007 file type, Mime types and identifying characters": "\nOffice 2007 MIME Types for IIS\n\n.docm, application/vnd.ms-word.document.macroEnabled.12\n.docx, application/vnd.openxmlformats-officedocument.wordprocessingml.document\n.dotm, application/vnd.ms-word.template.macroEnabled.12\n.dotx, application/vnd.openxmlformats-officedocument.wordprocessingml.template\n.potm, application/vnd.ms-powerpoint.template.macroEnabled.12\n.potx, application/vnd.openxmlformats-officedocument.presentationml.template\n.ppam, application/vnd.ms-powerpoint.addin.macroEnabled.12\n.ppsm, application/vnd.ms-powerpoint.slideshow.macroEnabled.12\n.ppsx, application/vnd.openxmlformats-officedocument.presentationml.slideshow\n.pptm, application/vnd.ms-powerpoint.presentation.macroEnabled.12\n.pptx, application/vnd.openxmlformats-officedocument.presentationml.presentation\n.xlam, application/vnd.ms-excel.addin.macroEnabled.12\n.xlsb, application/vnd.ms-excel.sheet.binary.macroEnabled.12\n.xlsm, application/vnd.ms-excel.sheet.macroEnabled.12\n.xlsx, application/vnd.openxmlformats-officedocument.spreadsheetml.sheet\n.xltm, application/vnd.ms-excel.template.macroEnabled.12\n.xltx, application/vnd.openxmlformats-officedocument.spreadsheetml.template\n\n", ".net 3.5 - Paging a collection with LINQ": "\nIt is very simple with the Skip and Take extension methods.\nvar query = from i in ideas\n            select i;\n\nvar paggedCollection = query.Skip(startIndex).Take(count);\n\n", "performance - What is the fastest way to get the value of π?": "\nThe Monte Carlo method, as mentioned, applies some great concepts but it is, clearly, not the fastest, not by a long shot, not by any reasonable measure. Also, it all depends on what kind of accuracy you are looking for. The fastest π I know of is the one with the digits hard coded. Looking at Pi and Pi[PDF], there are a lot of formulae.\nHere is a method that converges quickly — about 14 digits per iteration. PiFast, the current fastest application, uses this formula with the FFT. I'll just write the formula, since the code is straightforward. This formula was almost found by Ramanujan and discovered by Chudnovsky. It is actually how he calculated several billion digits of the number — so it isn't a method to disregard. The formula will overflow quickly and, since we are dividing factorials, it would be advantageous then to delay such calculations to remove terms.\n\n\nwhere,\n\nBelow is the Brent–Salamin algorithm. Wikipedia mentions that when a and b are \"close enough\" then (a + b)² / 4t will be an approximation of π. I'm not sure what \"close enough\" means, but from my tests, one iteration got 2 digits, two got 7, and three had 15, of course this is with doubles, so it might have an error based on its representation and the true calculation could be more accurate.\nlet pi_2 iters =\n    let rec loop_ a b t p i =\n        if i = 0 then a,b,t,p\n        else\n            let a_n = (a +. b) /. 2.0 \n            and b_n = sqrt (a*.b)\n            and p_n = 2.0 *. p in\n            let t_n = t -. (p *. (a -. a_n) *. (a -. a_n)) in\n            loop_ a_n b_n t_n p_n (i - 1)\n    in \n    let a,b,t,p = loop_ (1.0) (1.0 /. (sqrt 2.0)) (1.0/.4.0) (1.0) iters in\n    (a +. b) *. (a +. b) /. (4.0 *. t)\n\nLastly, how about some pi golf (800 digits)? 160 characters!\nint a=10000,b,c=2800,d,e,f[2801],g;main(){for(;b-c;)f[b++]=a/5;for(;d=0,g=c*2;c-=14,printf(\"%.4d\",e+d/a),e=d%a)for(b=c;d+=f[b]*a,f[b]=d%--g,d/=g--,--b;d*=b);}\n\n", "How do I add existing comments to RDoc in Ruby?": "\nA few things that have bitten me:\n\n:main: -- RDoc uses only the last one evaluated; best to make sure there's only one in your project and you don't also use the --main command-line argument.\nsame as previous, but for :title:\n:section: doesn't work very well\n\n", "eclipse - Getting Subclipse in Aptana to work with the newest release of Subversion": "\nSubclipse does not require Mylyn, but the update site includes a plugin that integrates Mylyn and Subclipse.  This is intended for people that use Mylyn.  In your case, you would want to just de-select Mylyn in the update dialog.\nSubclipse also requires Subversion 1.5 and the corresponding version of the JavaHL native libraries.  I have written the start of an FAQ to help people understand JavaHL and how to get it.  See: http://desktop-eclipse.open.collab.net/wiki/JavaHL\n", "apache flex - SQLStatement.execute() - multiple queries in one statement": "\nI wound up using this. It is a kind of a hack, but it actually works pretty well. \nThe only thing is you have to be very careful with your semicolons. : D\nvar strSql:String = stream.readUTFBytes(stream.bytesAvailable);      \nvar i:Number = 0;\nvar strSqlSplit:Array = strSql.split(\";\");\nfor (i = 0; i < strSqlSplit.length; i++){\n    NonQuery(strSqlSplit[i].toString());\n}\n\n", "php - Flat file databases": "\nWell, what is the nature of the flat databases.  Are they large or small.  Is it simple arrays with arrays in them?  if its something simple say userprofiles built as such:\n$user = array(\"name\" => \"bob\", \n              \"age\" => 20,\n              \"websites\" => array(\"example.com\",\"bob.example.com\",\"bob2.example.com\"),\n              \"and_one\" => \"more\");\n\nand to save or update the db record for that user.\n$dir = \"../userdata/\";  //make sure to put it bellow what the server can reach.\nfile_put_contents($dir.$user['name'],serialize($user));\n\nand to load the record for the user\nfunction &get_user($name){\n    return unserialize(file_get_contents(\"../userdata/\".$name));\n}\n\nbut again this implementation will vary on the application and nature of the database you need.\n", "linux - Is gettimeofday() guaranteed to be of microsecond resolution?": "\nMaybe. But you have bigger problems. gettimeofday() can result in incorrect timings if there are processes on your system that change the timer (ie, ntpd). On a \"normal\" linux, though, I believe the resolution of gettimeofday() is 10us. It can jump forward and backward and time, consequently, based on the processes running on your system. This effectively makes the answer to your question no.\nYou should look into clock_gettime(CLOCK_MONOTONIC) for timing intervals. It suffers from several less issues due to things like multi-core systems and external clock settings.\nAlso, look into the clock_getres() function.\n", "svn - How do you branch and merge with TortoiseSVN?": "\nMy easy click-by-click instructions (specific to TortoiseSVN) are in Stack Overflow question What is the simplest way to do branching and merging using TortoiseSVN?.\n", ".net - Anatomy of a \"Memory Leak\"": "\nThe best explanation I've seen is in Chapter 7 of the free Foundations of Programming e-book.\nBasically, in .NET a memory leak occurs when referenced objects are rooted and thus cannot be garbage collected. This occurs accidentally when you hold on to references beyond the intended scope.\nYou'll know that you have leaks when you start getting OutOfMemoryExceptions or your memory usage goes up beyond what you'd expect (PerfMon has nice memory counters). \nUnderstanding .NET's memory model is your best way of avoiding it. Specifically, understanding how the garbage collector works and how references work — again, I refer you to chapter 7 of the e-book. Also, be mindful of common pitfalls, probably the most common being events. If object A is registered to an event on object B, then object A will stick around until object B disappears because B holds a reference to A. The solution is to unregister your events when you're done. \nOf course, a good memory profile will let you see your object graphs and explore the nesting/referencing of your objects to see where references are coming from and what root object is responsible (red-gate ants profile, JetBrains dotMemory, memprofiler are really good choices, or you can use the text-only WinDbg and SOS, but I'd strongly recommend a commercial/visual product unless you're a real guru).\nI believe unmanaged code is subject to its typical memory leaks, except that shared references are managed by the garbage collector. I could be wrong about this last point.\n", "svn - Best Subversion clients for Windows Vista (64bit)": "\nI have been using the 64Bit version of TortoiseSVN for ages and I have never had issues with it on Windows 64Bit or Vista 64Bit. I am currently not aware of any other similiar SVN clients that do work on Vista. Is it possible the problem could lie within the configuration of TortoiseSVN or even the installation of Vista? Is the problem occurring on Vista native or SP 1?\n", "Decoding T-SQL CAST in C#/VB.NET": "\nI went back to Michael's post, did some more poking and realized that I did need to do a double conversion, and eventually worked out this little nugget:\nConvert.ToString(Convert.ToChar(Int32.Parse(EncodedString.Substring(intParseIndex, 2), System.Globalization.NumberStyles.HexNumber)));\n\nFrom there I simply made a loop to go through all the characters 2 by 2 and get them \"hexified\" and then translated to a string.\nTo Nick, and anybody else interested, I went ahead and posted my little application over in CodePlex. Feel free to use/modify as you need.\n", "sql - ASP.NET Site Maps": "\nThe Jeff Prosise version from MSDN magazine works pretty well, but it has a few flaws:\nAddNode freaks out with links to external sites on your menu (www.google.com, etc.)\nHere's my fix in BuildSiteMap():\nSiteMapNode node = GetSiteMapNodeFromReader(reader);\nstring url = node.Url;\nif (url.Contains(\":\"))\n{\n    string garbage = Guid.NewGuid().ToString();  // SiteMapNode needs unique URLs\n    node.Url = \"~/dummy_\" + garbage + \".aspx\";\n    AddNode(node, _root);\n    node.Url = url;\n}\nelse\n{\n    AddNode(node, _root);\n}\n\nSQLDependency caching is cool, but if you don't want to make a trip to the DB everytime your menu loads (to check to see if the dependency has changed) and your menus don't change very often, then why not use HttpRuntime.Cache instead?\npublic override SiteMapNode RootNode\n{\n    get\n    {\n        SiteMapNode temp = (SiteMapNode)HttpRuntime.Cache[\"SomeKeyName\"];\n        if (temp == null)\n        {\n            temp = BuildSiteMap();\n            HttpRuntime.Cache.Insert(\"SomeKeyName\", temp, null, DateTime.Now.AddHours(1), Cache.NoSlidingExpiration);\n        }\n        return temp;\n    }\n}\n\n", "Java lib or app to convert CSV to XML file?": "\nMaybe this might help: JSefa\nYou can read CSV file with this tool and serialize it to XML.\n"}